# SF Salaries Exercise

** Import pandas as pd.**

In [2]:
import pandas as pd
# to make pandas library

** Read Salaries.csv as a dataframe called sal.**

In [3]:
ys=pd.read_csv('C:/Users/PC/Desktop/Salaries.csv')
# to read the exel file

** Check the head of the DataFrame. **

In [4]:
ys.head()
# to get the first 5 elements in exel

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [12]:
ys.info()
#to get the data information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [13]:
ys.index
#to know how much colombns

RangeIndex(start=0, stop=148654, step=1)

**What is the average BasePay ?**

In [9]:
ys['BasePay'].mean()
            # to get the average of basepay in excel sheet

66325.4488404877

** What is the highest amount of OvertimePay in the dataset ? **

In [10]:
ys['OvertimePay'].max()
#to get the highest value of overtimepay

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [15]:
ys.groupby('JobTitle')
#to sort data according to jobtitle

In [23]:
by_jobtitle=ys.groupby('JobTitle')

#to save sorted data in element called by__jobtitle

In [57]:

ys[ys['EmployeeName'] == 'JOSEPH DRISCOLL']
ys.max()
#to get the data of JOSEPH DRISCOLL

Id                         148654
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                 319275.01
OvertimePay             245131.88
OtherPay                400184.25
Benefits                 96570.66
TotalPay                567595.43
TotalPayBenefits        567595.43
Year                         2014
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [56]:
ys[ys['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']
# to get total payne benefit of JOSEPH DRISCOLL

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [61]:
ys[ys['TotalPayBenefits']== ys['TotalPayBenefits'].max()]
# TO SORT DATA ACCORDING TO TOTAL BENEFITS

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [71]:
ys[ys['TotalPayBenefits']== ys['TotalPayBenefits'].min()]
#to get the minimum value of totalpays

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [62]:
yaso=ys.groupby('Year').mean()['BasePay']
yaso

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [73]:
yas4=ys['JobTitle'].unique()
yas4

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

** What are the top 5 most common jobs? **

In [39]:
ys['JobTitle'].value_counts().head(5)
#get the first five jobs only

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [69]:
yas2013=ys[ys['Year']==2013]['JobTitle'].value_counts()

yas2013
# to get the jobs title in 2013 year and count them

Transit Operator                  2295
Special Nurse                     1445
Registered Nurse                  1231
Public Svc Aide-Public Works       859
Custodian                          789
                                  ...
Sr General Utility Mechanic          1
Sprv Adult Prob Ofc (SFERS)          1
Mayoral Staff XII                    1
Pr Investigator, Tax Collector       1
Senior Assessment Clerk              1
Name: JobTitle, Length: 1051, dtype: int64

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [77]:
def jobtitle(x):
        if 'Chief' in x ==True:
            print(x)
        else: 
            return  False

jobtitle(ys)
# function to check if data have Chief or not

0

** How much does JOSEPH DRISCOLL make (including benefits)? **

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [80]:
ys[['title_len','TotalPayBenefits']].corr()
#to check the correlation

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!